app/controllers/application_controller.rb

	def index
		@user = current_user
		@user.current_status ||= "Update your current status and save"
		@recent_activity = Accomplishment.find(:all, :conditions => ["created_at > ?", 9.days.ago], :order => "created_at DESC")
		@users = User.find(:all, :conditions => "current_status is not null", :order => "first_name")
---
SELECT * FROM `accomplishments` WHERE (created_at > '2010-01-17 23:25:34') ORDER BY created_at DESC
SELECT * FROM `users` WHERE (current_status is not null) ORDER BY first_name

	def refresh_everyone
		@users = User.find(:all, :conditions => "current_status is not null", :order => "first_name")
---
SELECT * FROM `users` WHERE (current_status is not null) ORDER BY first_name

	def refresh_timeline
		@recent_activity = Accomplishment.find(:all, :conditions => ["created_at > ?", 9.days.ago], :order => "created_at DESC")
---
SELECT * FROM `accomplishments` WHERE (created_at > '2010-01-17 23:25:47') ORDER BY created_at DESC

	def add_accomplishment
		@user = current_user
		@user.accomplishments.create(:accomplishment => params[:add_accomplishment])
		@users = User.find(:all, :conditions => "current_status is not null", :order => "first_name")
		@recent_activity = Accomplishment.find(:all, :conditions => ["created_at > ?", 9.days.ago], :order => "created_at DESC")
---
INSERT INTO `accomplishments` (`accomplishment`, `created_at`, `updated_at`, `user_id`) VALUES('Got the logins to work', '2010-01-26 23:25:57', '2010-01-26 23:25:57', 1)
SELECT * FROM `users` WHERE (current_status is not null) ORDER BY first_name
SELECT * FROM `accomplishments` WHERE (created_at > '2010-01-17 23:25:57') ORDER BY created_at DESC

	def set_user_current_status
		@user = current_user
		@user.current_status = params[:value]
		@user.save
		@user.accomplishments.create(:accomplishment => "Changed Status: #{params[:value]}")
		@users = User.find(:all, :conditions => "current_status is not null", :order => "first_name")
		@recent_activity = Accomplishment.find(:all, :conditions => ["created_at > ?", 9.days.ago], :order => "created_at DESC")
---
UPDATE `users` SET `updated_at` = '2010-01-26 23:25:47', `current_status` = 'Doing it all' WHERE `id` = 1
INSERT INTO `accomplishments` (`accomplishment`, `created_at`, `updated_at`, `user_id`) VALUES('Changed Status: Doing it all', '2010-01-26 23:25:47', '2010-01-26 23:25:47', 1)
SELECT * FROM `users` WHERE (current_status is not null) ORDER BY first_name
SELECT * FROM `accomplishments` WHERE (created_at > '2010-01-17 23:25:47') ORDER BY created_at DESC